create table employee (id int, name varchar(100), surname varchar(100), specialty varchar(100), seniority int, salary int, age int);

insert employee (id, name, surname, specialty, seniority, salary, age)
values (1,'Вася', 'Васькин', 'начальник', 40, 100000, 60),
(2,'Петя', 'Петькин', 'начальник', 8, 70000, 30),
(3,'Катя', 'Каткина', 'инженер', 2, 70000, 25),
(4,'Саша', 'Сашкин', 'инженер', 12, 50000, 35),
(5,'Иван', 'Иванов', 'рабочий', 40, 30000, 59),
(6,'Петр', 'Петров', 'рабочий', 20, 25000, 40),
(7,'Сидор', 'Сидоров', 'рабочий', 10, 20000, 35),
(8,'Антон', 'Антонов', 'рабочий', 8, 19000, 28),
(9,'Юра', 'Юркин', 'рабочий', 5, 15000, 25),
(10,'Максим', 'Воронин', 'рабочий', 2, 11000, 22),
(11,'Юра', 'Галкин', 'рабочий', 3, 12000, 24),
(12,'Люся', 'Люськина', 'рабочий', 10, 10000, 49);

select * from employee;
-- 1.	Выведите все записи, отсортированные по полю "age" по возрастанию
select *
from employee
order by age;

-- 2.	Выведите все записи, отсортированные по полю "name"
select *
from employee
order by name DESC;

-- 3.	Выведите записи полей "name", "surname","age",
-- отсортированные по полю "name" в алфавитном порядке по убыванию
select name, surname, age
from employee
order by name;

-- 4.	Выполните сортировку по полям "name" и "age" по убыванию
select *
from employee
order by name, age;
